
// При відкритті сторінки виведіть на екран повідомлення Hello!:

// alert('Hello!');

// Задайте ідентифікатор (id) спану, виведіть його в консоль у вигляді html-коду та у вигляді об'єкта:

console.log(span_like_button);
console.dir(span_like_button);

// Виведіть в консоль повідомлення про реєстрацію нового користувача, оздобивши відповідним до змісту повідомлення кольором:
// Занадто простий пароль, бажано використати більше символів.
// Сервер не відповідає, дані неможливо отримати.

let value = prompt('Щоб завершити реєстрацію користувача введіть пароль:', '');
function showMassage(){
	if(value.length==0){
		console.error('Сервер не відповідає, дані неможливо отримати.');
	}
	else if (value.length<5){
		console.warn('Занадто простий пароль, бажано використати більше символів.');
	}
}
showMassage();

// Виведіть в консоль групу строк з кольорами райдуги:

console.groupCollapsed('Група строк з кольорами райдуги');

let color = ['red','orange', 'yellow', 'green', 'light blue', 'blue', 'purple'], i;

for(i=0;i<color.length;i++){
	console.log(color[i]);
}

console.groupEnd();

// Створіть три змінних a, b та c, задайте їм довільні числові значення.
// Виведіть в консоль результат обчислення a * b + c у вигляді повної формули, напкриклад:
// "5 * 8 + 4 = 44"

let a=3, b=16, c=7;
console.log(a+' * '+b+' + '+c+' = '+(a*b+c));